RIET/src/Catalogs/КостЦентры/КостЦентры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КостЦентры</name>
  <comment>Параллельный с подразделениями учет ОС </comment>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultActivity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OnlyMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>NonLawson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Geomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>SubGeomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/InformationRegisters/AUsAndBORGs/AUsAndBORGs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AUsAndBORGs</name>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BORG</name>
    <type>
      <types>CatalogRef.BORGs</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Catalogs/КостЦентры/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзAUsAndBORGs" Тогда
			НастроитьДляВыбораИзAUsAndBORGs(СтруктураНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Отбор = Параметры.Отбор;
	
	Отбор.Вставить("ПометкаУдаления", Ложь);
	
	//[РКХ->]
	ParentCompanyPA = Справочники.SoldTo.НайтиПоКоду("PA");
	Если ЗначениеЗаполнено(ParentCompanyPA) Тогда  
		Список.Параметры.УстановитьЗначениеПараметра("ParentCompanyPA", Справочники.SoldTo.НайтиПоКоду("PA"));
	КонецЕсли;
	//[<-РКХ]
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзAUsAndBORGs(СтруктураНастройки)
	
	Если ЗначениеЗаполнено(СтруктураНастройки.BORG) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("BORG", СтруктураНастройки.BORG);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	AUsAndBORGs.AU
			|ИЗ
			|	Справочник.BORGs КАК BORGs
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.AUsAndBORGs КАК AUsAndBORGs
			|		ПО BORGs.Ссылка <> AUsAndBORGs.BORG
			|			И BORGs.Компания = AUsAndBORGs.BORG.Компания
			|ГДЕ
			|	BORGs.Ссылка = &BORG";
			
		МассивЗапрещенныхAUs = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("AU");
		Если МассивЗапрещенныхAUs.Количество() Тогда
			
			СписокЗапрещенныхAUs = Новый СписокЗначений;
			СписокЗапрещенныхAUs.ЗагрузитьЗначения(МассивЗапрещенныхAUs);
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Список.Отбор,
				"Ссылка",
				СписокЗапрещенныхAUs,
				ВидСравненияКомпоновкиДанных.НеВСписке,
				,
				Истина);
			
		КонецЕсли; 
				
	КонецЕсли; 
	
КонецПроцедуры
